# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'fzf'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'neovim'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure

# Development
brew 'imagemagick'
brew 'node'
brew 'yarn'

# Apps
cask 'appcleaner'
cask 'calibre'
cask 'docker'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
cask 'iterm2'
cask 'java'
cask 'karabiner-elements'
cask 'kindle'
cask 'rectangle'
cask 'spotify'
cask 'the-unarchiver'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'

# Quicklook - space on file for quick look
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
