# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroidsÞ
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'
brew 'gnupg2'
brew 'grep'
# brew 'httpie'
# brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
# brew 'stripe/stripe-cli/stripe'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure

# Development
# brew 'imagemagick'
brew 'node'
# brew 'redis'
brew 'yarn'

# Apps
# cask '1password'
# cask 'aerial'
# cask 'alfred'
# cask 'bartender'
# cask 'caffeine'
# cask 'discord'
cask 'docker'
# cask 'firefox'
# cask 'github'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
# cask 'insomnia' - similar to postman
cask 'java'
# cask 'screenflow'
# cask 'sip'
# cask 'skype'
# cask 'slack'
# cask 'tableplus'
# cask 'telegram-desktop'
# cask 'there' - useful for timezones
cask 'the-unarchiver'
# cask 'tor-browser'
cask 'transmission'
cask 'transmit'
cask 'vlc'
# cask 'whatsapp'

# Quicklook - space on file for quick look
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Spark', id: 1176895641
